---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveElement
source: html/a0ce4bdd-e200-ecb9-dd62-c9934690536e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveElement Property

Can't move element.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMoveElement { get; }
```